comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_SATASSD_TwitterCluster1_Benchmarking/RocksDB_0.1B_in0.2B_val267_mem64MB_Cluster1_CT04_level1base512_targetbase64_Blk8_Blkcache8_Tabcache5000.log
RocksDB:    version 9.4.0
Date:       Sun May 11 12:15:18 2025
CPU:        112 * Intel(R) Xeon(R) Gold 6348 CPU @ 2.60GHz
CPUCache:   43008 KB
workload_num: 100000000 entries_per_batch_:1
 The key size:80 value size:128 
The k_size:80 The v_size:267 
Total bytes written: 144
Set seed to 1746936918463202 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       80 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    200000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    39672.9 MB (estimated)
FileSize:   15258.8 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 5
------------------------------------------------
DB path: [/mnt/db_test/rocks10B/Cluster1_0.2B_mem64MB_CT4_L1base512_targetbase64_Block8]
the row_data[5] is:get
the row_data[5] is:get
the row_data[5] is:get
[...]
clusterQuery :       2.263 micros/op 441815 ops/sec 225.978 seconds 99840311 operations;   61.4 MB/s PERF_CONTEXT:
user_key_comparison_count = 2335848951, block_cache_hit_count = 3998609, block_read_count = 14240, block_read_byte = 114210562, block_read_time = 2903307281, block_read_cpu_time = 333187524, block_cache_index_hit_count = 0, block_cache_standalone_handle_count = 0, block_cache_real_handle_count = 0, index_block_read_count = 0, block_cache_filter_hit_count = 0, filter_block_read_count = 0, compression_dict_block_read_count = 0, block_cache_index_read_byte = 0, block_cache_filter_read_byte = 0, block_cache_compression_dict_read_byte = 0, block_cache_read_byte = 32441684640, secondary_cache_hit_count = 0, compressed_sec_cache_insert_real_count = 0, compressed_sec_cache_insert_dummy_count = 0, compressed_sec_cache_uncompressed_bytes = 0, compressed_sec_cache_compressed_bytes = 0, block_checksum_time = 10666053, block_decompress_time = 0, get_read_bytes = 26525215926, multiget_read_bytes = 0, iter_read_bytes = 0, blob_cache_hit_count = 0, blob_read_count = 0, blob_read_byte = 0, blob_read_time = 0, blob_checksum_time = 0, blob_decompress_time = 0, internal_key_skipped_count = 0, internal_delete_skipped_count = 0, internal_recent_skipped_count = 0, internal_merge_count = 0, internal_merge_point_lookup_count = 0, internal_range_del_reseek_count = 0, get_snapshot_time = 6254381198, get_from_memtable_time = 65792364743, get_from_memtable_count = 99415105, get_post_process_time = 8832645768, get_from_output_files_time = 10628801952, seek_on_memtable_time = 0, seek_on_memtable_count = 0, next_on_memtable_count = 0, prev_on_memtable_count = 0, seek_child_seek_time = 0, seek_child_seek_count = 0, seek_min_heap_time = 0, seek_max_heap_time = 0, seek_internal_seek_time = 0, find_next_user_entry_time = 0, write_wal_time = 1653460329, write_memtable_time = 739991428, write_delay_time = 0, write_scheduling_flushes_compactions_time = 29546123, write_pre_and_post_process_time = 150309848, write_thread_wait_nanos = 0, db_mutex_lock_nanos = 0, db_condition_wait_nanos = 0, merge_operator_time_nanos = 0, read_index_block_nanos = 0, read_filter_block_nanos = 0, new_table_block_iter_nanos = 4105479527, new_table_iterator_nanos = 0, block_seek_nanos = 2818067430, find_table_nanos = 0, bloom_memtable_hit_count = 0, bloom_memtable_miss_count = 0, bloom_sst_hit_count = 4012841, bloom_sst_miss_count = 70782, key_lock_wait_time = 0, key_lock_wait_count = 0, env_new_sequential_file_nanos = 0, env_new_random_access_file_nanos = 0, env_new_writable_file_nanos = 0, env_reuse_writable_file_nanos = 0, env_new_random_rw_file_nanos = 0, env_new_directory_nanos = 0, env_file_exists_nanos = 0, env_get_children_nanos = 0, env_get_children_file_attributes_nanos = 0, env_delete_file_nanos = 0, env_create_dir_nanos = 0, env_create_dir_if_missing_nanos = 0, env_delete_dir_nanos = 0, env_get_file_size_nanos = 0, env_get_file_modification_time_nanos = 0, env_rename_file_nanos = 0, env_link_file_nanos = 0, env_lock_file_nanos = 0, env_unlock_file_nanos = 0, env_new_logger_nanos = 0, get_cpu_nanos = 129155919202, iter_next_cpu_nanos = 0, iter_prev_cpu_nanos = 0, iter_seek_cpu_nanos = 0, iter_next_count = 0, iter_prev_count = 0, iter_seek_count = 0, encrypt_data_nanos = 0, decrypt_data_nanos = 0, number_async_seek = 0, bloom_filter_useful = 70782@level0, 0@level1, bloom_filter_full_positive = 3956750@level0, 56091@level1, bloom_filter_full_true_positive = 3955831@level0, 56091@level1, user_key_return_count = 3955831@level0, 56091@level1, get_from_table_nanos = 8337891089@level0, 1301706849@level1, block_cache_hit_count = 3947992@level0, 50617@level1, block_cache_miss_count = 8766@level0, 5474@level1
Microseconds per read:
Count: 99345378 Average: 2.2414  StdDev: 3.34
Min: 1  Median: 1.5956  Max: 17513
Percentiles: P50: 1.60 P75: 1.92 P99: 3.94 P99.9: 6.58 P99.99: 191.55
------------------------------------------------------
[       0,       1 ]  3700809   3.725%   3.725% #
(       1,       2 ] 77181498  77.690%  81.415% ################
(       2,       3 ] 13742265  13.833%  95.248% ###
(       3,       4 ]  3947097   3.973%  99.221% #
(       4,       6 ]   664656   0.669%  99.890% 
(       6,      10 ]    67516   0.068%  99.958% 
(      10,      15 ]    14835   0.015%  99.973% 
(      15,      22 ]     7658   0.008%  99.981% 
(      22,      34 ]     3953   0.004%  99.985% 
(      34,      51 ]      624   0.001%  99.985% 
(      51,      76 ]      170   0.000%  99.986% 
(      76,     110 ]      893   0.001%  99.987% 
(     110,     170 ]     1105   0.001%  99.988% 
(     170,     250 ]     8778   0.009%  99.996% 
(     250,     380 ]     3435   0.003% 100.000% 
(     380,     580 ]       63   0.000% 100.000% 
(     580,     870 ]       12   0.000% 100.000% 
(     870,    1300 ]        2   0.000% 100.000% 
(    1300,    1900 ]        5   0.000% 100.000% 
(    1900,    2900 ]        3   0.000% 100.000% 
(   14000,   22000 ]        1   0.000% 100.000% 

Microseconds per write:
Count: 494933 Average: 6.6829  StdDev: 67.48
Min: 3  Median: 5.2475  Max: 9526
Percentiles: P50: 5.25 P75: 6.66 P99: 13.89 P99.9: 20.63 P99.99: 236.69
------------------------------------------------------
(       2,       3 ]       18   0.004%   0.004% 
(       3,       4 ]    77149  15.588%  15.591% ###
(       4,       6 ]   273025  55.164%  70.755% ###########
(       6,      10 ]   126959  25.652%  96.407% #####
(      10,      15 ]    16496   3.333%  99.740% #
(      15,      22 ]      984   0.199%  99.939% 
(      22,      34 ]      174   0.035%  99.974% 
(      34,      51 ]       26   0.005%  99.979% 
(      51,      76 ]       14   0.003%  99.982% 
(      76,     110 ]        9   0.002%  99.984% 
(     110,     170 ]       12   0.002%  99.986% 
(     170,     250 ]       21   0.004%  99.991% 
(     250,     380 ]        2   0.000%  99.991% 
(     380,     580 ]        1   0.000%  99.991% 
(    1300,    1900 ]        1   0.000%  99.992% 
(    1900,    2900 ]        1   0.000%  99.992% 
(    2900,    4400 ]        3   0.001%  99.992% 
(    4400,    6600 ]        9   0.002%  99.994% 
(    6600,    9900 ]       29   0.006% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   19.71 MB   0.8      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     86.8      0.23              0.15         3    0.076       0      0       0.0       0.0
  L1      1/0   10.97 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum      4/0   30.68 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     86.8      0.23              0.15         3    0.076       0      0       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     73.4      0.18              0.15         2    0.092       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     73.4      0.18              0.15         2    0.092       0      0       0.0       0.0
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0    144.0      0.04              0.00         1    0.043       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 226.3 total, 226.0 interval
Flush(GB): cumulative 0.019, interval 0.013
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 0.09 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Interval compaction: 0.01 GB write, 0.06 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x582a03970a80#3135611 capacity: 8.00 MB seed: 1920488162 usage: 0.09 KB table_size: 256 occupancy: 1 collections: 1 last_copies: 0 last_secs: 6.6e-05 secs_since: 225
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 8769 Average: 201.6238  StdDev: 73.02
Min: 65  Median: 204.3958  Max: 2903
Percentiles: P50: 204.40 P75: 230.18 P99: 363.09 P99.9: 736.17 P99.99: 2903.00
------------------------------------------------------
(      51,      76 ]       49   0.559%   0.559% 
(      76,     110 ]     1120  12.772%  13.331% ###
(     110,     170 ]      291   3.319%  16.650% #
(     170,     250 ]     6802  77.569%  94.218% ################
(     250,     380 ]      482   5.497%  99.715% #
(     380,     580 ]       13   0.148%  99.863% 
(     580,     870 ]        6   0.068%  99.932% 
(     870,    1300 ]        2   0.023%  99.954% 
(    1300,    1900 ]        2   0.023%  99.977% 
(    1900,    2900 ]        1   0.011%  99.989% 
(    2900,    4400 ]        1   0.011% 100.000% 

** Level 1 read latency histogram (micros):
Count: 5475 Average: 205.5943  StdDev: 70.03
Min: 69  Median: 205.9876  Max: 2793
Percentiles: P50: 205.99 P75: 230.23 P99: 358.29 P99.9: 727.42 P99.99: 2626.25
------------------------------------------------------
(      51,      76 ]        1   0.018%   0.018% 
(      76,     110 ]      387   7.068%   7.087% #
(     110,     170 ]      318   5.808%  12.895% #
(     170,     250 ]     4516  82.484%  95.379% ################
(     250,     380 ]      238   4.347%  99.726% #
(     380,     580 ]        8   0.146%  99.872% 
(     580,     870 ]        3   0.055%  99.927% 
(     870,    1300 ]        1   0.018%  99.945% 
(    1300,    1900 ]        1   0.018%  99.963% 
(    1900,    2900 ]        2   0.037% 100.000% 


** DB Stats **
Uptime(secs): 226.3 total, 226.0 interval
Cumulative writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 0.17 GB, 0.76 MB/s
Cumulative WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.76 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 171.34 MB, 0.76 MB/s
Interval WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.76 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0

STATISTICS:
rocksdb.block.cache.miss COUNT : 14240
rocksdb.block.cache.hit COUNT : 3998609
rocksdb.block.cache.add COUNT : 14240
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.data.miss COUNT : 14240
rocksdb.block.cache.data.hit COUNT : 3998609
rocksdb.block.cache.data.add COUNT : 14240
rocksdb.block.cache.data.bytes.insert COUNT : 115566320
rocksdb.block.cache.bytes.read COUNT : 32441684640
rocksdb.block.cache.bytes.write COUNT : 115566320
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 0
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 0
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.secondary.cache.hits COUNT : 0
rocksdb.secondary.cache.filter.hits COUNT : 0
rocksdb.secondary.cache.index.hits COUNT : 0
rocksdb.secondary.cache.data.hits COUNT : 0
rocksdb.compressed.secondary.cache.dummy.hits COUNT : 0
rocksdb.compressed.secondary.cache.hits COUNT : 0
rocksdb.compressed.secondary.cache.promotions COUNT : 0
rocksdb.compressed.secondary.cache.promotion.skips COUNT : 0
rocksdb.bloom.filter.useful COUNT : 70782
rocksdb.bloom.filter.full.positive COUNT : 4012841
rocksdb.bloom.filter.full.true.positive COUNT : 4011922
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.bloom.filter.prefix.true.positive COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 95333456
rocksdb.memtable.miss COUNT : 4011922
rocksdb.l0.hit COUNT : 3955831
rocksdb.l1.hit COUNT : 56091
rocksdb.l2andup.hit COUNT : 0
rocksdb.compaction.key.drop.new COUNT : 0
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 494933
rocksdb.number.keys.read COUNT : 99345378
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 179660679
rocksdb.bytes.read COUNT : 26525215926
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.no.file.opens COUNT : 4
rocksdb.no.file.errors COUNT : 0
rocksdb.stall.micros COUNT : 0
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 179660679
rocksdb.write.self COUNT : 494933
rocksdb.write.other COUNT : 0
rocksdb.write.wal COUNT : 494933
rocksdb.compact.read.bytes COUNT : 0
rocksdb.compact.write.bytes COUNT : 6509217
rocksdb.flush.write.bytes COUNT : 14157372
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 5
rocksdb.number.superversion_releases COUNT : 1
rocksdb.number.superversion_cleanups COUNT : 1
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.bytes.compressed.from COUNT : 0
rocksdb.bytes.compressed.to COUNT : 0
rocksdb.bytes.compression_bypassed COUNT : 20560398
rocksdb.bytes.compression.rejected COUNT : 0
rocksdb.number.block_compression_bypassed COUNT : 2540
rocksdb.number.block_compression_rejected COUNT : 0
rocksdb.bytes.decompressed.from COUNT : 0
rocksdb.bytes.decompressed.to COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.compaction.total.time.cpu_micros COUNT : 0
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.blobdb.cache.miss COUNT : 0
rocksdb.blobdb.cache.hit COUNT : 0
rocksdb.blobdb.cache.add COUNT : 0
rocksdb.blobdb.cache.add.failures COUNT : 0
rocksdb.blobdb.cache.bytes.read COUNT : 0
rocksdb.blobdb.cache.bytes.write COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.marked.trash.deleted COUNT : 0
rocksdb.files.deleted.immediately COUNT : 3
rocksdb.error.handler.bg.error.count COUNT : 0
rocksdb.error.handler.bg.io.error.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.error.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.memtable.payload.bytes.at.flush COUNT : 127467010
rocksdb.memtable.garbage.bytes.at.flush COUNT : 110199455
rocksdb.verify_checksum.read.bytes COUNT : 0
rocksdb.backup.read.bytes COUNT : 0
rocksdb.backup.write.bytes COUNT : 0
rocksdb.remote.compact.read.bytes COUNT : 0
rocksdb.remote.compact.write.bytes COUNT : 0
rocksdb.hot.file.read.bytes COUNT : 0
rocksdb.warm.file.read.bytes COUNT : 0
rocksdb.cold.file.read.bytes COUNT : 0
rocksdb.hot.file.read.count COUNT : 0
rocksdb.warm.file.read.count COUNT : 0
rocksdb.cold.file.read.count COUNT : 0
rocksdb.last.level.read.bytes COUNT : 0
rocksdb.last.level.read.count COUNT : 0
rocksdb.non.last.level.read.bytes COUNT : 114715545
rocksdb.non.last.level.read.count COUNT : 14244
rocksdb.last.level.seek.filtered COUNT : 0
rocksdb.last.level.seek.filter.match COUNT : 0
rocksdb.last.level.seek.data COUNT : 0
rocksdb.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.non.last.level.seek.filtered COUNT : 0
rocksdb.non.last.level.seek.filter.match COUNT : 0
rocksdb.non.last.level.seek.data COUNT : 0
rocksdb.non.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.non.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.block.checksum.compute.count COUNT : 14252
rocksdb.block.checksum.mismatch.count COUNT : 0
rocksdb.multiget.coroutine.count COUNT : 0
rocksdb.read.async.micros COUNT : 0
rocksdb.async.read.error.count COUNT : 0
rocksdb.table.open.prefetch.tail.miss COUNT : 0
rocksdb.table.open.prefetch.tail.hit COUNT : 20
rocksdb.timestamp.filter.table.checked COUNT : 0
rocksdb.timestamp.filter.table.filtered COUNT : 0
rocksdb.readahead.trimmed COUNT : 0
rocksdb.fifo.max.size.compactions COUNT : 0
rocksdb.fifo.ttl.compactions COUNT : 0
rocksdb.prefetch.bytes COUNT : 0
rocksdb.prefetch.bytes.useful COUNT : 503850
rocksdb.prefetch.hits COUNT : 20
rocksdb.footer.corruption.count COUNT : 0
rocksdb.db.get.micros P50 : 0.564519 P95 : 1.755418 P99 : 2.734370 P100 : 2814.000000 COUNT : 99345378 SUM : 106000069
rocksdb.db.write.micros P50 : 3.857520 P95 : 9.092462 P99 : 11.846718 P100 : 9525.000000 COUNT : 494933 SUM : 2739136
rocksdb.compaction.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.times.cpu_micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 1450.000000 P95 : 1853.000000 P99 : 1853.000000 P100 : 1853.000000 COUNT : 3 SUM : 3892
rocksdb.compaction.outfile.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 430.000000 P95 : 501.000000 P99 : 501.000000 P100 : 501.000000 COUNT : 3 SUM : 1298
rocksdb.table.open.io.micros P50 : 1300.000000 P95 : 2977.000000 P99 : 2977.000000 P100 : 2977.000000 COUNT : 4 SUM : 6716
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.get.micros P50 : 209.255186 P95 : 331.527132 P99 : 372.551274 P100 : 2804.000000 COUNT : 14248 SUM : 2990758
rocksdb.write.raw.block.micros P50 : 0.878360 P95 : 11.165842 P99 : 93.340000 P100 : 2652.000000 COUNT : 2549 SUM : 48982
rocksdb.numfiles.in.singlecompaction P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.read.micros P50 : 205.030924 P95 : 258.630556 P99 : 361.503889 P100 : 2903.000000 COUNT : 14244 SUM : 2893668
rocksdb.file.read.flush.micros P50 : 870.000000 P95 : 979.000000 P99 : 979.000000 P100 : 979.000000 COUNT : 2 SUM : 1713
rocksdb.file.read.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.open.micros P50 : 1300.000000 P95 : 2903.000000 P99 : 2903.000000 P100 : 2903.000000 COUNT : 2 SUM : 3924
rocksdb.file.read.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.iterator.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.db.checksum.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.file.checksums.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.write.micros P50 : 0.552894 P95 : 2.619014 P99 : 14.852451 P100 : 2646.000000 COUNT : 5101 SUM : 47206
rocksdb.file.write.flush.micros P50 : 0.556724 P95 : 4.252941 P99 : 16.190000 P100 : 2646.000000 COUNT : 3494 SUM : 32769
rocksdb.file.write.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.write.db.open.micros P50 : 0.544746 P95 : 2.418939 P99 : 3.960370 P100 : 2264.000000 COUNT : 1607 SUM : 14437
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 267.000000 P95 : 267.000000 P99 : 267.000000 P100 : 267.000000 COUNT : 99345378 SUM : 26525215926
rocksdb.bytes.per.write P50 : 363.000000 P95 : 363.000000 P99 : 363.000000 P100 : 363.000000 COUNT : 494933 SUM : 179660679
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 92500.000000 P95 : 98305.000000 P99 : 98305.000000 P100 : 98305.000000 COUNT : 2 SUM : 184007
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiget.io.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.level.read.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.async.read.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.poll.wait.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.prefetched.bytes.discarded P50 : 92500.000000 P95 : 130463.000000 P99 : 130463.000000 P100 : 130463.000000 COUNT : 4 SUM : 365570
rocksdb.async.prefetch.abort.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.open.prefetch.tail.read.bytes P50 : 140000.000000 P95 : 180224.000000 P99 : 180224.000000 P100 : 180224.000000 COUNT : 4 SUM : 506368